; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=10, locations=12, density=0.24242424242424243, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=21, seed=62

(define (problem transport-21)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l11)
    (at p2 l6)
    (at p3 l3)
    (at p4 l9)
    (at p5 l3)
    (at p6 l3)
    (at p7 l1)
    (at p8 l5)
    (at p9 l11)
    (at p10 l3)
    (at v1 l2)
    (at v2 l1)
    (at v3 l8)
    (at v4 l8)
    (at v5 l9)
    (road l5 l9)
    (road l10 l11)
    (road l11 l2)
    (road l7 l2)
    (road l11 l10)
    (road l1 l10)
    (road l8 l6)
    (road l5 l4)
    (road l4 l5)
    (road l9 l3)
    (road l7 l5)
    (road l3 l9)
    (road l8 l7)
    (road l10 l1)
    (road l2 l7)
    (road l6 l8)
    (road l8 l12)
    (road l5 l7)
    (road l2 l11)
    (road l9 l5)
    (road l7 l8)
    (road l12 l8)
    (road l6 l10)
    (road l10 l6)
    (road l8 l11)
    (road l11 l8)
    (road l3 l6)
    (road l6 l3)
    (road l1 l6)
    (road l6 l1)
    (road l1 l9)
    (road l9 l1)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l8)
    (at p3 l10)
    (at p4 l6)
    (at p5 l1)
    (at p6 l7)
    (at p7 l2)
    (at p8 l8)
    (at p9 l5)
    (at p10 l7))))

; plan
1. (drive v1 l2 l11)
   deleted: (at v1 l2)
   added: (at v1 l11)
   goals met: 0 of 10
2. (pick-up v1 l11 p1 c0 c1)
   deleted: (at p1 l11) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 10
3. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 0 of 10
4. (drive v1 l8 l6)
   deleted: (at v1 l8)
   added: (at v1 l6)
   goals met: 0 of 10
5. (drop v1 l6 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l6) (capacity v1 c1)
   goals met: 1 of 10
6. (pick-up v2 l1 p7 c0 c1)
   deleted: (at p7 l1) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 1 of 10
7. (drive v2 l1 l10)
   deleted: (at v2 l1)
   added: (at v2 l10)
   goals met: 1 of 10
8. (drive v2 l10 l11)
   deleted: (at v2 l10)
   added: (at v2 l11)
   goals met: 1 of 10
9. (drive v2 l11 l2)
   deleted: (at v2 l11)
   added: (at v2 l2)
   goals met: 1 of 10
10. (drop v2 l2 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l2) (capacity v2 c1)
   goals met: 2 of 10
11. (drive v2 l2 l11)
   deleted: (at v2 l2)
   added: (at v2 l11)
   goals met: 2 of 10
12. (drive v3 l8 l11)
   deleted: (at v3 l8)
   added: (at v3 l11)
   goals met: 2 of 10
13. (drive v1 l6 l8)
   deleted: (at v1 l6)
   added: (at v1 l8)
   goals met: 2 of 10
14. (pick-up v5 l9 p4 c1 c2)
   deleted: (at p4 l9) (capacity v5 c2)
   added: (in p4 v5) (capacity v5 c1)
   goals met: 2 of 10
15. (drive v5 l9 l1)
   deleted: (at v5 l9)
   added: (at v5 l1)
   goals met: 2 of 10
16. (drive v5 l1 l10)
   deleted: (at v5 l1)
   added: (at v5 l10)
   goals met: 2 of 10
17. (drive v5 l10 l6)
   deleted: (at v5 l10)
   added: (at v5 l6)
   goals met: 2 of 10
18. (drop v5 l6 p4 c1 c2)
   deleted: (in p4 v5) (capacity v5 c1)
   added: (at p4 l6) (capacity v5 c2)
   goals met: 3 of 10
19. (pick-up v5 l6 p1 c1 c2)
   deleted: (at p1 l6) (capacity v5 c2)
   added: (in p1 v5) (capacity v5 c1)
   goals met: 2 of 10
20. (pick-up v5 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v5 c1)
   added: (in p2 v5) (capacity v5 c0)
   goals met: 2 of 10
21. (drive v5 l6 l8)
   deleted: (at v5 l6)
   added: (at v5 l8)
   goals met: 2 of 10
22. (drop v5 l8 p2 c0 c1)
   deleted: (in p2 v5) (capacity v5 c0)
   added: (at p2 l8) (capacity v5 c1)
   goals met: 3 of 10
23. (drive v5 l8 l6)
   deleted: (at v5 l8)
   added: (at v5 l6)
   goals met: 3 of 10
24. (drop v5 l6 p1 c1 c2)
   deleted: (in p1 v5) (capacity v5 c1)
   added: (at p1 l6) (capacity v5 c2)
   goals met: 4 of 10
25. (drive v5 l6 l3)
   deleted: (at v5 l6)
   added: (at v5 l3)
   goals met: 4 of 10
26. (pick-up v5 l3 p3 c1 c2)
   deleted: (at p3 l3) (capacity v5 c2)
   added: (in p3 v5) (capacity v5 c1)
   goals met: 4 of 10
27. (drive v5 l3 l6)
   deleted: (at v5 l3)
   added: (at v5 l6)
   goals met: 4 of 10
28. (drive v5 l6 l10)
   deleted: (at v5 l6)
   added: (at v5 l10)
   goals met: 4 of 10
29. (drop v5 l10 p3 c1 c2)
   deleted: (in p3 v5) (capacity v5 c1)
   added: (at p3 l10) (capacity v5 c2)
   goals met: 5 of 10
30. (drive v5 l10 l6)
   deleted: (at v5 l10)
   added: (at v5 l6)
   goals met: 5 of 10
31. (drive v5 l6 l3)
   deleted: (at v5 l6)
   added: (at v5 l3)
   goals met: 5 of 10
32. (pick-up v5 l3 p10 c1 c2)
   deleted: (at p10 l3) (capacity v5 c2)
   added: (in p10 v5) (capacity v5 c1)
   goals met: 5 of 10
33. (drive v5 l3 l9)
   deleted: (at v5 l3)
   added: (at v5 l9)
   goals met: 5 of 10
34. (drive v5 l9 l5)
   deleted: (at v5 l9)
   added: (at v5 l5)
   goals met: 5 of 10
35. (pick-up v5 l5 p8 c0 c1)
   deleted: (at p8 l5) (capacity v5 c1)
   added: (in p8 v5) (capacity v5 c0)
   goals met: 5 of 10
36. (drive v5 l5 l7)
   deleted: (at v5 l5)
   added: (at v5 l7)
   goals met: 5 of 10
37. (drop v5 l7 p10 c0 c1)
   deleted: (in p10 v5) (capacity v5 c0)
   added: (at p10 l7) (capacity v5 c1)
   goals met: 6 of 10
38. (drive v5 l7 l8)
   deleted: (at v5 l7)
   added: (at v5 l8)
   goals met: 6 of 10
39. (drop v5 l8 p8 c1 c2)
   deleted: (in p8 v5) (capacity v5 c1)
   added: (at p8 l8) (capacity v5 c2)
   goals met: 7 of 10
40. (drive v1 l8 l6)
   deleted: (at v1 l8)
   added: (at v1 l6)
   goals met: 7 of 10
41. (pick-up v3 l11 p9 c0 c1)
   deleted: (at p9 l11) (capacity v3 c1)
   added: (in p9 v3) (capacity v3 c0)
   goals met: 7 of 10
42. (drive v3 l11 l8)
   deleted: (at v3 l11)
   added: (at v3 l8)
   goals met: 7 of 10
43. (drive v3 l8 l7)
   deleted: (at v3 l8)
   added: (at v3 l7)
   goals met: 7 of 10
44. (drive v3 l7 l5)
   deleted: (at v3 l7)
   added: (at v3 l5)
   goals met: 7 of 10
45. (drop v3 l5 p9 c0 c1)
   deleted: (in p9 v3) (capacity v3 c0)
   added: (at p9 l5) (capacity v3 c1)
   goals met: 8 of 10
46. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 8 of 10
47. (pick-up v1 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 8 of 10
48. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 8 of 10
49. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 8 of 10
50. (drop v1 l1 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l1) (capacity v1 c1)
   goals met: 9 of 10
51. (drive v3 l5 l9)
   deleted: (at v3 l5)
   added: (at v3 l9)
   goals met: 9 of 10
52. (drive v3 l9 l3)
   deleted: (at v3 l9)
   added: (at v3 l3)
   goals met: 9 of 10
53. (pick-up v3 l3 p6 c0 c1)
   deleted: (at p6 l3) (capacity v3 c1)
   added: (in p6 v3) (capacity v3 c0)
   goals met: 9 of 10
54. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 9 of 10
55. (drive v3 l6 l8)
   deleted: (at v3 l6)
   added: (at v3 l8)
   goals met: 9 of 10
56. (drive v3 l8 l7)
   deleted: (at v3 l8)
   added: (at v3 l7)
   goals met: 9 of 10
57. (drop v3 l7 p6 c0 c1)
   deleted: (in p6 v3) (capacity v3 c0)
   added: (at p6 l7) (capacity v3 c1)
   goals met: 10 of 10
